{
  "Game": "Игра",
  "Bets": "Ставки",
  "Info": "Инфо",
  "ChooseANumber": "Выбери число",
  "YourBet": "Твоя ставка",
  "TimeLeft": "До конца игры осталось",
  "NumberOfPlayers": "Кол-во игроков",
  "TotalAmount": "Общая сумма",
  "NoHistory": "Нет истории",
  "Bet": "Ставка",
  "Address": "Адрес",
  "YourAddress": "Твой адрес",
  "Results": "Результаты",
  "Articles": "Статьи",
  "HowToPlay": "Как играть",
  "How often is the lottery held": "Как часто проводится лотерея?",
  "How do I know if I won": "Как узнать, выиграл ли я?",
  "Which wallets are supported": "Какие кошельки поддерживаются?",
  "Do I need to confirm the bet": "Нужно ли подтверждать ставку?",
  "How is the prize pool calculated": "Как рассчитывается призовой фонд?",
  "Is there a minimum bet amount": "Есть ли минимальная сумма ставки?",
  "How is the fairness of the lottery ensured": "Как обеспечена честность лотереи?",
  "Are there transaction fees": "Есть ли комиссия за транзакции?",
  "How much commission does the dealer take": "Сколько комиссии забирает дилер?",
  "What happens if there are no winners": "Что происходит, если нет победителей?",
  "The lottery is held every hour. You can participate in any draw by placing a bet before the start of the next hour.": "Лотерея проводится каждый час. Участвовать можно в любом розыгрыше, сделав ставку до начала следующего часа.",
  "The results of each draw are published in the Telegram channel. You can check if your number matches the winning one.": "Результаты каждого розыгрыша публикуются в Telegram-канале. Вы можете проверить, совпало ли ваше число с выигрышным.",
  "Wallets that work with TON are supported.": "Поддерживаются кошельки, которые работают с TON.",
  "Yes, to participate in the lottery, you need to confirm the bet in your wallet. This ensures the security and authorization of the transaction.": "Да, для участия в лотерее необходимо подтвердить ставку в вашем кошельке. Это обеспечивает безопасность и авторизацию транзакции.",
  "The prize pool is formed from all bets placed by participants in the current draw. Winners share it among themselves proportionally to their bets.": "Призовой фонд формируется из всех ставок, сделанных участниками в текущем розыгрыше. Победители делят его между собой пропорционально своим ставкам.",
  "Yes, the minimum bet amount is 0.15 TON. Make sure your bet meets the requirements.": "Да, минимальная сумма ставки 0.15 TON. Убедитесь, что ваша ставка соответствует требованиям.",
  "A smart contract is used to guarantee the fairness and transparency of the draw. The winning number is generated randomly, and the results are published publicly.": "Используется смарт-контракт, который гарантирует честность и прозрачность розыгрыша. Выигрышное число генерируется случайным образом, и результаты публикуются в открытом доступе.",
  "Yes, a transaction fee is charged when placing a bet in the TON network. The fee amount depends on the current network load and is determined by your wallet.": "Да, при совершении ставки взимается комиссия за транзакцию в сети TON. Размер комиссии зависит от текущей загрузки сети и определяется вашим кошельком.",
  "The dealer takes 1% of each bet. This commission goes towards maintaining the lottery and developing the platform.": "Дилер забирает 1% от каждой ставки. Эта комиссия идет на поддержание работы лотереи и развитие платформы.",
  "If there are no winners in a draw (no one guessed the winning number), all bets are returned to the players minus the transaction fees and the 1% taken by the dealer. This ensures that the funds are not lost, even if no one wins.": "Если в розыгрыше нет ни одного победителя (никто не угадал выигрышное число), все ставки возвращаются игрокам за вычетом комиссии за транзакции и 1%, которые забирает дилер. Это гарантирует, что средства не пропадают, даже если никто не выиграл.",

  "Welcome to the lottery!": "Добро пожаловать в лотерею!",
  "This is a unique opportunity to try your luck and win prizes by betting on numbers from 1 to 10. The lottery is held every hour, and you can participate using TON Smart Contract. It's simple: you place a bet, choose a number, and if it matches the number generated by the smart contract, you become a winner!": "Это уникальная возможность испытать удачу и выиграть призы, делая ставки на числа от 1 до 10. Лотерея проводится каждый час, и вы можете участвовать в ней, используя TON Smart Contract. Все просто: вы делаете ставку, выбираете число, и если оно совпадает с числом, сгенерированным смарт-контрактом, вы становитесь победителем!",
  "How to participate?": "Как участвовать?",
  "Authorization via wallet:": "Авторизация через кошелек:",
  "Click the blue button <span class='$1'>Connect Wallet</span> and authorize via your TON wallet (e.g., Tonkeeper). Don't forget to confirm the authorization in your wallet.": "Нажмите на синюю кнопку <span class='$1'>Connect Wallet</span> (Подключить кошелек) и авторизуйтесь через ваш TON-кошелек (например, Tonkeeper). Не забудьте подтвердить авторизацию в вашем кошельке.",
  "Choosing a bet:": "Выбор ставки:",
  "In the app, select a number from 1 to 10 and specify the bet amount. After that, the <span class='$1'>Play</span> button will appear.": "В приложении выберите число от 1 до 10 и укажите сумму ставки. После этого появится кнопка <span class='$1'>Играть</span>.",
  "Transaction confirmation:": "Подтверждение транзакции:",
  "Click the Play button, after which you will need to confirm the transaction in your wallet. This is necessary to complete the bet and participate in the lottery.": "Нажмите кнопку Играть, после чего вам нужно будет подтвердить транзакцию в вашем кошельке. Это необходимо для завершения ставки и участия в лотерее.",
  "Waiting for results:": "Ожидание результатов:",
  "Telegram-channel": "Telegram-канале",
  "After confirming the transaction, wait for the draw results, which will be published in the $1. Check if your number matches the winning one!": "После подтверждения транзакции дождитесь результатов розыгрыша, которые будут опубликованы в $1. Проверьте, совпало ли ваше число с выигрышным!",
  "Good luck! 🍀": "Удачи! 🍀",
  "Play": "Играть",
  "Where can I get feedback?": "Где можно получить обратную связь?",
  "For any questions, you can contact our support team at: tenlotminiapp@gmail.com. We respond within 24 hours.": "По всем вопросам вы можете обратиться в нашу службу поддержки по электронной почте: tenlotminiapp@gmail.com. Мы отвечаем в течение 24 часов."
}